Revit 2027 API
KeyBasedTreeEntriesLoadContent.GetEntries Method
 Gets a copy of KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public KeyBasedTreeEntries GetEntries()
Public Function GetEntries As KeyBasedTreeEntries
public:
KeyBasedTreeEntries^ GetEntries()
member GetEntries : unit -> KeyBasedTreeEntries
Return Value
KeyBasedTreeEntries
 A copy of KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object.
Exceptions
Exception | Condition
InvalidOperationException |  The KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object is not built yet. The information about this KeyBasedTreeEntries object is not available.
See Also
Reference
KeyBasedTreeEntriesLoadContent Class
Autodesk.Revit.DB Namespace